"""Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый,
зеленый. Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды,
третьего (зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном порядке
(красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.

Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее сообщение и
завершать скрипт. """

import time


class TrafficLight:
    __color: str = 'red'

    def running(self, len_red: int, len_yellow: int, len_green: int):
        switch = {'red': len_red, 'yellow': len_yellow, 'green': len_green}
        while True:
            for k, v in switch.items():
                self.__color = k
                print(f'- switched to {self.__color}')
                time.sleep(v)


a = TrafficLight()
print(a.running(7, 5, 3))
