"""Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина). Значения данных
атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными. Определить метод расчета
массы асфальта, необходимого для покрытия всего дорожного полотна. Использовать формулу: длина*ширина*масса асфальта
для покрытия одного кв метра дороги асфальтом, толщиной в 1 см*число см толщины полотна. Проверить работу метода. """


class Road:
    _length: int
    _width: int

    def __init__(self, length_m, width_m):
        self._length, self._width = length_m, width_m

    def asphalt_mass(self, mass_cm_sq_m, depth_cm):
        return self._length * self._width * mass_cm_sq_m * depth_cm


a = Road(20, 5000)
print(a.asphalt_mass(25, 5))
