"""
Создайте собственный класс-исключение, который должен проверять содержимое списка на наличие только чисел.
Проверить работу исключения на реальном примере. Необходимо запрашивать у пользователя данные и заполнять список
только числами. Класс-исключение должен контролировать типы данных элементов списка.

Примечание: длина списка не фиксирована. Элементы запрашиваются бесконечно, пока пользователь сам не остановит
работу скрипта, введя, например, команду “stop”. При этом скрипт завершается, сформированный список с числами
выводится на экран.

Подсказка: для данного задания примем, что пользователь может вводить только числа и строки. При вводе
пользователем очередного элемента необходимо реализовать проверку типа элемента и вносить его в список,
только если введено число. Класс-исключение должен не позволить пользователю ввести текст (не число) и
отобразить соответствующее сообщение. При этом работа скрипта не должна завершаться. """

import re


class NotNumber(Exception):

    def __str__(self):
        return 'That\'s not a numbers.'


res = []
print('Press \'ctrl + D\' to complete your list.')

while True:
    try:
        num = input('Enter new number: ')
        # если в строке есть символы, вызываем ошибку
        if re.sub(r'[^\w\S]+|[\d]+', r'', num.strip()):
            raise NotNumber
        res.append(int(num))
    except EOFError:
        print(f'Done! Your list: {res}')
        exit()
    except NotNumber:
        print('Not added. Please, print numbers only.')
