"""Создать (не программно) текстовый файл. Необходимо написать программу, открывающую файл на чтение и считывающую
построчно данные. При этом английские числительные должны заменяться на русские. Новый блок строк должен записываться
в новый текстовый файл. """

# Допустим, откуда-то получили строку и преобразовали в список
nums_new = ['Один', 'Два', 'Три', 'Четыре', 'Пять', 'Шесть']

# Разбираем файл, заменяем слова по индексам списка, формируем содержимое нового файла
nums_out = []
with open('5-04-nums-in.txt', 'r') as file:
    for line in file:
        line_in = line.replace('\n', '').split(' — ')
        new_index = (int(line_in[1]) - 1)
        line_in[0] = nums_new[new_index]
        nums_out.append(line_in)

# Записываем полученные строки в файл
with open(f'5-04-nums-out.txt', 'w') as file:
    for el in nums_out:
        file.writelines(f'{el[0]} — {el[1]}\n')
    print(f'Your data saved in \'5-03-nums-out.txt\' file')
