"""Создать вручную и заполнить несколькими строками текстовый файл, в котором каждая строка должна содержать данные о
фирме: название, форма собственности, выручка, издержки. Пример строки файла: firm_1 ООО 10000 5000.

Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль. Если фирма получила
убытки, в расчет средней прибыли ее не включать. Далее реализовать список. Он должен содержать словарь с фирмами и их
прибылями, а также словарь со средней прибылью. Если фирма получила убытки, также добавить ее в словарь (со значением
убытков). Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].

Итоговый список сохранить в виде json-объекта в соответствующий файл.
Пример json-объекта: [{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]"""

import json

res_list = []

with open('5-07-firms.txt', 'r') as file:
    profit_firms = 0
    profit_total = 0

    # Собираем список фирм со значением прибыли
    firms = {}
    for line in file:
        firm = line.replace('\n', '').split(' ')
        gain = float(firm[2]) - float(firm[3])
        firms.update({firm[0]: round(gain, 2)})

        # Считаем среднюю прибыль
        # Фирмы с убытками не учитываем
        if gain > 0:
            profit_firms += 1
            profit_total += gain

    # Заполняем итоговый список
    res_list.append(firms)
    res_list.append({'average_profit': round(profit_total / profit_firms, 2)})

# Сохраняем в json
with open('5-07-firms-out.json', 'w') as export:
    json.dump(res_list, export)
